content/posts/PCAforImage.md
---
title: "Image Compression Based on Principal Component Analysis (PCA)"
categories: ["ComputerVision"]
draft: true
---

## Introduction {#introduction}

Principal Component Analysis (PCA) is a linear dimensionality reduction technique (algorithm) that transform a set of correlated variables (p) into a smaller k (k<p) number of uncorrelated variables called principal components while keeping as much of the variability in the original data as possible.

One of the use cases of PCA is that it can be used for image compression — a technique that minimizes the size in bytes of an image while keeping as much of the quality of the image as possible.
